CSI API ETABS v1
cSapModel.GetVersion Method
 Returns the program version.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetVersion(
	ref string Version,
	ref double MyVersionNumber
)
Function GetVersion (
	ByRef Version As String,
	ByRef MyVersionNumber As Double
) As Integer
Dim instance As cSapModel
Dim Version As String
Dim MyVersionNumber As Double
Dim returnValue As Integer
returnValue = instance.GetVersion(Version,
	MyVersionNumber)
int GetVersion(
	String^% Version,
	double% MyVersionNumber
)
abstract GetVersion :
        Version : string byref *
        MyVersionNumber : float byref -> int
Parameters
Version
Type: System.String
MyVersionNumber
Type: System.Double
 The program version number that is used internally by the program and not displayed to the user.
Return Value
Type: Int32
 Returns zero if the information is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Version As String
       Dim MyVersionNumber As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'get program version
       ret = SapModel.GetVersion(Version, MyVersionNumber)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace